system_management/app/Models/PinModel.php

SELECT *
FROM `bir_pin`
 LIMIT 1
---
    public function getHashedPin(){
        $pin = $this->first();