system_management/app/Controllers/CompanySwitcher/CompanySwitcherController.php

    public function switchCompany($company_code)
    {
        $company = $this->companyModel->where('compcode', $company_code)->first();
---
SELECT *
FROM `company`
WHERE `compcode` = '002'
 LIMIT 1