system_management/app/Controllers/PinController.php

SELECT *
FROM `company`
---
    public function verifyPin(){
        $pin = $this->request->getPost('pin');
        // Retrieve the hashed pin from the database
        $hashed_pin = $this->pinModel->getHashedPin(); // Assume this method retrieves the hashed pin
        if (password_verify($pin, $hashed_pin)) {
            session()->set('pin_verified', true);
            $companies = $this->companyModel->findAll();