system_management/app/Controllers/BIRForms/BIRYearFormController.php

SELECT *
FROM `bir_year`
WHERE `bir_year`.`id` = '2'
---
    public function edit($yearId){
        $year = $this->yearModel->find($yearId);