system_management/app/Models/BIRForms/BIRYearModel.php

SELECT `bir_year`.`id`, `bir_year`.`year`
FROM `bir_year`
WHERE `bir_year`.`id` NOT IN (SELECT `year_id` FROM `bir_year_form_registration` WHERE `compcode` = '002')
ORDER BY `bir_year`.`year` ASC
---
    public function getYearsWithoutEntries()
    {
        $currentCompanyCode = session()->get('current_company')->company_code;

        $query = $this->db->table('bir_year')
                          ->select('bir_year.id, bir_year.year')
                          ->whereNotIn('bir_year.id', function($builder) use ($currentCompanyCode) {
                              return $builder->select('year_id')
                                             ->from('bir_year_form_registration')
                                             ->where('compcode', $currentCompanyCode);
                          })
                          ->orderBy('bir_year.year', 'ASC');

        return $query->get()->getResult();